*** DONE test the mock cli tool on the specs

our mock should pass this test

#+RESULTS:

#+BEGIN_SRC shell :tangle run-mock.sh
# make the mock executable
chmod +x affectiva-cli-mock.js
# test the cli specs on the mock
node affectiva-cli.specs.js -b 'affectiva-cli-mock.js' | ./node_modules/.bin/tap-spec
#+END_SRC

#+RESULTS:
| bin       | to        | execute | affectiva-cli-mock.js |                 |                  |           |        |      |    |   |
|           |           |         |                       |                 |                  |           |        |      |    |   |
| test      | affectiva | specs   | on                    | shell           | commandundefined |           |        |      |    |   |
|           |           |         |                       |                 |                  |           |        |      |    |   |
| ✔         | should    | be      | no                    | error           | in               | calling   |        |      |    |   |
| ✔         | should    | be      | no                    | error           | from             | process's | stdout |      |    |   |
| ✔         | result    | should  | exist                 |                 |                  |           |        |      |    |   |
| ✔         | result    | should  | be                    | valid           | json             |           |        |      |    |   |
| ✔         | result    | should  | be                    | a               | list             |           |        |      |    |   |
| ✔         | object    | should  | have                  | expressions     | field            |           |        |      |    |   |
| ✔         | object    | should  | have                  | emotions        | field            |           |        |      |    |   |
| ✔         | object    | should  | have                  | timestamps      | field,           | where     | first  | item | is | 0 |
| ✔         | object    | should  | have                  | 'date-and-time' | field            |           |        |      |    |   |
|           |           |         |                       |                 |                  |           |        |      |    |   |
|           |           |         |                       |                 |                  |           |        |      |    |   |
| total:    | 9         |         |                       |                 |                  |           |        |      |    |   |
| passing:  | 9         |         |                       |                 |                  |           |        |      |    |   |
| duration: | 1.1s      |         |                       |                 |                  |           |        |      |    |   |
|           |           |         |                       |                 |                  |           |        |      |    |   |
|           |           |         |                       |                 |                  |           |        |      |    |   |

